Map = [\
	"###############",
	"# @  @    @  *#",
	"# # # # # # # #",
	"#  @     @    #",
	"# # # # # # # #",
	"#      @ 1  @ #",
	"# # # # #1# # #",
	"#    @ 22%441 #",
	"# # # # #3# # #",
	"#  @     3   $#",
	"# # # # # # # #",
	"#     @       #",
	"# # # # # # # #",
	"# $       @   #",
	"###############"\
]

# #-- 固定墙，不可被炸毁
# @-- 普通墙， 炸弹可以炸毁
# &-- 道具， 人可以拾取道具
# $-- 炸弹
# %-- 正在爆炸的炸弹
# 1, 2, 3, 4 代表四个方向的火焰
# *-- 被炸毁的普通墙

def change_map(pos, new_str):
	Map[pos[0]] = Map[pos[0]][:pos[1]] + new_str + Map[pos[0]][pos[1] + 1:]